# Data Types

When reading in a data set, pandas will try to guess the data type of each column like float, integer, datettime, bool, etc. In Pandas, strings are called "object" dtypes. 

However, Pandas does not always get this right. That was the issue with the World Bank projects data. Hence, the dtype was specified as a string:
```
df_projects = pd.read_csv('../data/projects_data.csv', dtype=str)
```

Run the code cells below to read in the indicator and projects data. Then run the following code cell to see the dtypes of the indicator data frame.

In [1]:
# Run this code cell

import pandas as pd

# read in the population data and drop the final column
df_indicator = pd.read_csv('C:/Users/Ajaz/Python/Udacity/3. Data Engineering/1 csv_exercise/population_data.csv', skiprows=4)
df_indicator.drop(['Unnamed: 62'], axis=1, inplace=True)

# read in the projects data set with all columns type string
df_projects = pd.read_csv('C:/Users/Ajaz/Python/Udacity/3. Data Engineering/1 csv_exercise/projects_data.csv', dtype=str)
df_projects.drop(['Unnamed: 56'], axis=1, inplace=True)

In [2]:
# Run this code cell 
df_indicator.dtypes

Country Name       object
Country Code       object
Indicator Name     object
Indicator Code     object
1960              float64
                   ...
2013              float64
2014              float64
2015              float64
2016              float64
2017              float64
Length: 62, dtype: object

In [44]:
df_indicator.head(2)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,101353.0,101453.0,101669.0,102053.0,102577.0,103187.0,103795.0,104341.0,104822.0,105264.0
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996351.0,9166764.0,9345868.0,9533954.0,9731361.0,9938414.0,...,27294031.0,28004331.0,28803167.0,29708599.0,30696958.0,31731688.0,32758020.0,33736494.0,34656032.0,35530081.0

In [50]:
df_indicator.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968',
       '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977',
       '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995',
       '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004',
       '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015', '2016', '2017'],
      dtype='object')

In [55]:
df=df_indicator.drop(['Country Code', 'Indicator Name', 'Indicator Code'], axis=1)
df.head(1)

,Country Name,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Aruba,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,57715.0,58055.0,58386.0,...,101353.0,101453.0,101669.0,102053.0,102577.0,103187.0,103795.0,104341.0,104822.0,105264.0

In [77]:
df[(df['Country Name'] =='United States') |(df['Country Name'] =='Canada') | (df['Country Name'] =='Mexico')].iloc[:,1:]

,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
33,17909009.0,18271000.0,18614000.0,18964000.0,19325000.0,19678000.0,20048000.0,20412000.0,20744000.0,21028000.0,...,33245773.0,33628571.0,34005274.0,34342780.0,34750545.0,35152370.0,35535348.0,35832513.0,36264604.0,36708083.0
152,38174112.0,39394126.0,40649588.0,41939880.0,43264272.0,44623043.0,46011038.0,47429812.0,48894019.0,50423481.0,...,113661809.0,115505228.0,117318941.0,119090017.0,120828307.0,122535969.0,124221600.0,125890949.0,127540423.0,129163276.0
249,180671000.0,183691000.0,186538000.0,189242000.0,191889000.0,194303000.0,196560000.0,198712000.0,200706000.0,202677000.0,...,304093966.0,306771529.0,309338421.0,311644280.0,313993272.0,316234505.0,318622525.0,321039839.0,323405935.0,325719178.0

In [36]:
df = pd.DataFrame({'c1': [10, 11, 12], 'c2': [100, 110, 120]})
df

   c1   c2
0  10  100
1  11  110
2  12  120

In [38]:
for index, row in df.iterrows():
    if row['c1']==10:
        print(row)

c1     10
c2    100
Name: 0, dtype: int64

In [40]:
for index, row in df_indicator.iterrows():
    if df_indicator['Country Name']=='Canada':
        print(row)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df_indicator['Country Name']

These results look reasonable. Country Name, Country Code, Indicator Name and Indicator Code were all read in as strings. The year columns, which contain the population data, were read in as floats.

# Exercise 1

Since the population indicator data was read in correctly, you can run calculations on the data. In this first exercise, sum the populations of the United States, Canada, and Mexico by year.

In [ ]:
# TODO: Calculate the population sum by year for Canada,
#       the United States, and Mexico.


# the keepcol variable makes a list of the column names to keep. You can use this if you'd like
keepcol = ['Country Name']
for i in range(1960, 2018, 1):
    keepcol.append(str(i))



# TODO: In the df_nafta variable, store a data frame that only contains the rows for 
#      Canada, United States, and Mexico.
df_nafta = None


# TODO: Calculate the sum of the values in each column in order to find the total population by year.
# You can use the keepcol variable if you want to control which columns get outputted

In [24]:
keepcol = ['Country Name']
for i in range(1960, 2018, 1):
    keepcol.append(str(i))

In [25]:
keepcol

['Country Name',
 '1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013',
 '2014',
 '2015',
 '2016',
 '2017']

In [18]:
df_indicator.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968',
       '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977',
       '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995',
       '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004',
       '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015', '2016', '2017'],
      dtype='object')

In [33]:
if df['Country Name']='Mexico':

AttributeError: 'Series' object has no attribute 'Mexico'

In [22]:
df=df_indicator.drop(['Country Code', 'Indicator Name', 'Indicator Code'], axis=1)

In [29]:
df.sum(axis = 0, skipna = True)

Country Name    ArubaAfghanistanAngolaAlbaniaAndorraArab World...
1960                                                  3.06292e+10
1961                                                  3.10409e+10
1962                                                  3.15911e+10
1963                                                  3.22761e+10
1964                                                  3.29665e+10
1965                                                  3.36742e+10
1966                                                  3.44196e+10
1967                                                  3.51637e+10
1968                                                   3.5921e+10
1969                                                  3.67153e+10
1970                                                  3.75212e+10
1971                                                  3.83467e+10
1972                                                  3.91645e+10
1973                                                   3.9977e+10
1974                                                  4.07918e+10
1975                                                  4.15909e+10
1976                                                  4.23764e+10
1977                                                  4.31586e+10
1978                                                  4.39542e+10
1979                                                  4.47686e+10
1980                                                  4.55931e+10
1981                                                  4.64391e+10
1982                                                  4.73189e+10
1983                                                  4.82088e+10
1984                                                  4.90976e+10
1985                                                  5.00037e+10
1986                                                  5.09367e+10
1987                                                  5.18937e+10
1988                                                  5.28611e+10
1989                                                  5.38292e+10
1990                                                  5.48175e+10
1991                                                  5.57663e+10
1992                                                  5.66916e+10
1993                                                  5.76195e+10
1994                                                  5.85368e+10
1995                                                  5.94577e+10
1996                                                  6.03632e+10
1997                                                  6.12693e+10
1998                                                  6.21649e+10
1999                                                  6.30501e+10
2000                                                  6.39271e+10
2001                                                  6.48024e+10
2002                                                  6.56746e+10
2003                                                  6.65515e+10
2004                                                  6.74344e+10
2005                                                  6.83237e+10
2006                                                  6.92191e+10
2007                                                  7.01199e+10
2008                                                  7.10342e+10
2009                                                   7.1957e+10
2010                                                  7.28855e+10
2011                                                   7.3811e+10
2012                                                   7.4756e+10
2013                                                  7.57188e+10
2014                                                  7.66891e+10
2015                                                  7.76619e+10
2016                                                  7.86403e+10
2017                                                  7.96176e+10
dtype: object

# Exercise 2

Now, run the code cell below to look at the dtypes for the projects data set. They should all be "object" types, ie strings, because that's what was specified in the code when reading in the csv file. As a reminder, this was the code:
```
df_projects = pd.read_csv('../data/projects_data.csv', dtype=str)
```

In [34]:
# Run this code cell
df_projects.dtypes

id                          object
regionname                  object
countryname                 object
prodline                    object
lendinginstr                object
lendinginstrtype            object
envassesmentcategorycode    object
supplementprojectflg        object
productlinetype             object
projectstatusdisplay        object
status                      object
project_name                object
boardapprovaldate           object
board_approval_month        object
closingdate                 object
lendprojectcost             object
ibrdcommamt                 object
idacommamt                  object
totalamt                    object
grantamt                    object
borrower                    object
impagency                   object
url                         object
projectdoc                  object
majorsector_percent         object
sector1                     object
sector2                     object
sector3                     object
sector4                     object
sector5                     object
sector                      object
mjsector1                   object
mjsector2                   object
mjsector3                   object
mjsector4                   object
mjsector5                   object
mjsector                    object
theme1                      object
theme2                      object
theme3                      object
theme4                      object
theme5                      object
theme                       object
goal                        object
financier                   object
mjtheme1name                object
mjtheme2name                object
mjtheme3name                object
mjtheme4name                object
mjtheme5name                object
location                    object
GeoLocID                    object
GeoLocName                  object
Latitude                    object
Longitude                   object
Country                     object
dtype: object

Many of these columns should be strings, so there's no problem; however, a few columns should be other data types. For example, `boardapprovaldate` should be a datettime and `totalamt` should be an integer. You'll learn about datetime formatting in the next part of the lesson. For this exercise, focus on the 'totalamt' and 'lendprojectcost' columns. Run the code cell below to see what that data looks like

In [3]:
# Run this code cell
df_projects[['totalamt', 'lendprojectcost']].head()

      totalamt lendprojectcost
0            0         500,000
1  200,000,000     200,000,000
2   58,330,000      50,000,000
3   20,000,000      50,000,000
4  100,000,000     100,000,000

In [6]:
a=pd.Series(df_projects['totalamt'])

In [9]:
a.dtype

dtype('O')

In [12]:
a=a.str.replace(',','')

In [ ]:
pd.to_numeric(a)

In [19]:
df_projects['totalamt'].replace(",","")

0                  0
1        200,000,000
2         58,330,000
3         20,000,000
4        100,000,000
            ...
18243     13,500,000
18244     12,000,000
18245     40,000,000
18246    195,000,000
18247    250,000,000
Name: totalamt, Length: 18248, dtype: object

In [22]:
df_projects['totalamt']=pd.to_numeric(df_projects['totalamt'].str.replace(",",""))

What just happened? Pandas treated the totalamts like strings. In Python, adding strings concatenates the strings together.

There are a few ways to remedy this. When using pd.read_csv(), you could specify the column type for every column in the data set. The pd.read_csv() dtype option can accept a dictionary mapping each column name to its data type. You could also specify the `thousands` option with `thousands=','`. This specifies that thousands are separated by a comma in this data set. 

However, this data is somewhat messy, contains missing values, and has a lot of columns. It might be faster to read in the entire data set with string types and then convert individual columns as needed. For this next exercise, convert the `totalamt` column from a string to an integer type.

In [ ]:
# TODO: Convert the totalamt column from a string to a float and save the results back into the totalamt column

# Step 1: Remove the commas from the 'totalamt' column
# HINT: https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.Series.str.replace.html

# Step 2: Convert the 'totalamt' column from an object data type (ie string) to an integer data type.
# HINT: https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.to_numeric.html

df_projects['totalamt'] = pd.to_numeric(df_projects['totalamt'].str.replace(",",""))

# Conclusion

With messy data, you might find it easier to read in everything as a string; however, you'll sometimes have to convert those strings to more appropriate data types. When you output the dtypes of a dataframe, you'll generally see these values in the results:
* float64
* int64
* bool
* datetime64
* timedelta
* object

where timedelta is the difference between two datetimes and object is a string. As you've seen here, you sometimes need to convert data types from one type to another type. Pandas has a few different methods for converting between data types, and here are link to the documentation:

* [astype](https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.DataFrame.astype.html#pandas.DataFrame.astype)
* [to_datetime](https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.to_datetime.html#pandas.to_datetime)
* [to_numeric](https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.to_numeric.html#pandas.to_numeric)
* [to_timedelta](https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.to_timedelta.html#pandas.to_timedelta)